{
  "schritt1": "Importiere die Java-Bibliothek java.util.* . Hierzu muss in der ersten Zeile des Editors folgender Code hinzugefügt werden: import java.util.*;",
  "schritt2": "Erstelle die Integer Variable zahl1 und weise ihr einen Zufälligen Wert von 1-6 zu. Dies geschieht wie folgt: int zahl1 = (int)((Math.random()) * 6 + 1);",
  "schritt3": "Wiederhole den schritt2 für die Variable zahl2.",
  "schritt4": "Erstelle die Integer Variable ergebnis und weise ihr den Wert 0 zu. (int ergebnis=0;)",
  "schritt5": "Prüfe ob die Zahlen 2 und 1 gewürfelt wurden und weise in diesem Fall dem ergebnis den Wert 1000 zu. Dies geschieht über folgende if-Anweisung: if(zahl1 ==2 && zahl2 ==1 || zahl1==1 && zahl2==2) in den {} der if-Anweisung muss dem Ergebnis der Wert 1000 zugewiesen werden. Hierfür wird folgender Code verwendet: ergebnis=1000; Anschließend wird der Wert der Variablen ergebnis über die System.out.println() Funktion ausgegeben."
  "schritt6": "Wenn die Zahlen nicht 2 und 1 sind, muss überprüft werden ob es sich um einen Pasch handelt. Hierfür wird eine else if-Anweisung verwendet: else if(zahl1 == zahl2) Wenn das der Fall ist sollen die beiden zahlen addiert werden und das ergebnis mit 100 multipliziert werden. Die zuweisung der Variablen ergebnis sieht wie folgt aus: ergebnis=(zahl1+zahl2)*100; Anschließend wird die Variable ergebnis wieder mithilfe der Funktion System.out.println() ausgegeben.",
  "schritt7": "Wenn auch kein Pasch gewürfelt wurde, muss geschaut werden, welche von den beiden Zahlen die größere ist, um auch hier das korrekte Ergebnis auszugeben. Auch dies geschieht über eine else if-Anweisung. Hierdurch wird die erste Prüfung realisiert: else if(zahl1<zahl2) In diesem Fall handelt es sich bei zahl 2 um die größere und somit muss diese zuerst ausgegeben werden. (System.out.println(zahl2 + zahl1);)"
  "schritt8": "Zuletzt muss noch die letzte Variante abgefangen werden. Hierbei handelt es sich um eine letzte else-Anweisung. Damit wird der Fall abgefangen, das die zahl1 die größere ist. In diesem Fall sieht die Funktion für die Ausgabe wie folgt aus: System.out.println(zahl1 + zahl2)"
}